W6/W6D3/FirstProject/app/controllers/artworks_controller.rb

    def update
        @artwork = Artwork.find_by(id: params[:id])
        unless @artwork
            render json: {error: 'Artwork not found'}
            return
        end

        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2 WHERE "artworks"."id" = $3  [["title", "very bad art work"], ["image_url", "www.idk.idc/updated"], ["id", 16]]

    def destroy
        @artwork = Artwork.find_by(id: params[:id])
        if @artwork
            @artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 16]]