W6/W6D3/FirstProject/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
          @comments = Comment.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
          @comments = Comment.where(artwork_id: params[:artwork_id])
        else
          @comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 22]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 6]]

    def create
        @comment = Comment.new(comment_params)
        if @comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 27], ["artwork_id", 15], ["body", "this is not too bad"], ["created_at", "2021-08-12 21:55:22.371979"], ["updated_at", "2021-08-12 21:55:22.371979"]]

    def destroy
        @comment = Comment.find_by(id: params[:id])
        if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]