W6/W6D3/FirstProject/app/controllers/users_controller.rb

  def create
    @user = User.new(params.require(:user).permit(:username, :email))

    if @user.save
---
INSERT INTO "users" ("username", "email") VALUES ($1, $2) RETURNING "id"  [["username", "test7"], ["email", "test7@gmail.com"]]

  def update
    @user = User.find_by(id: params[:id])

    unless @user
      render json: {error: "There is no user with that id"}
      return
    end

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "email" = $2 WHERE "users"."id" = $3  [["username", "test69"], ["email", "test69@gmail.com"], ["id", 15]]

  def destroy
    @user = User.find_by(id: params[:id])

    if @user
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]