W7/W7D2/MusicApp/app/controllers/bands_controller.rb

  def create
    @band = Band.new(band_params)
    if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "DFeng"], ["created_at", "2021-08-18 00:05:34.446527"], ["updated_at", "2021-08-18 00:05:34.446527"]]