W6/W6D3/ArtShareAPI/app/controllers/users_controller.rb

  def index
    if params.has_key?(:username)
      @users = User.where('username LIKE ?', "%#{params[:username]}%")
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%Henry%')

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email") VALUES ($1, $2) RETURNING "id"  [["username", "test7"], ["email", "test7@gmail.com"]]

  def update
    @user = User.find_by(id: params[:id])

    unless @user
      render json: {error: "There is no user with that id"}
      return
    end

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "email" = $2 WHERE "users"."id" = $3  [["username", "test69"], ["email", "test69@gmail.com"], ["id", 15]]