W7/W7D5/redditclone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id
        if @sub.save!
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test Sub"], ["description", "Heres a sub for me"], ["user_id", 2], ["created_at", "2021-08-20 18:42:36.882565"], ["updated_at", "2021-08-20 18:42:36.882565"]]