W7/W7D5/redditclone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Mickey"], ["session_token", "z72pip2SZgUOkl9KYW1h2A"], ["created_at", "2021-08-20 16:52:49.379778"], ["updated_at", "2021-08-20 16:52:49.379778"]]
---
  def create
    @user = User.new(user_params)

    if @user.save!